{"title":"About us","url":"/en/about-us/","showInNav":true,"sections":[{"value":{"backgroundImage":"73190df947d424c787b77f330d205183225656ab","text":"<h1 id=\"what-is-sweet-surrender\">What is Sweet Surrender?</h1>\n\n<p>That is a good question.</p>\n","button":{"target":"_self","text":null,"href":null}},"schemaId":"fullHeightBanner"},{"value":{"button":{"target":"_self"},"text":"<p>Most people would say that we are a children friendly, non-profit caf&eacute; that wants to give all its visitors a break from the turmoil of everyday life by serving high-standard coffee and tea, affordable and proper meal and a warm smile.</p>\n\n<p>But we are also a group of warm hearted volunteers from all parts of the world, that work together to make the caf&eacute; the biggest hit possible. Because every profit made and all our tips are send directly to a worthy cause. Thankfully this common goal also makes us good friends and a happy bunch to be with at the same time.</p>\n\n<h3 id=\"non-profit\">Non-profit</h3>\n\n<p>Over the course of time Caf&eacute; Sweet Surrender has donated all its profit to organisations that help people in a more direct way then we can. If you want to see who has benefited from our support, you can find a list here on the homepage. And if you want to help us help more people &ndash; just buy two coffees instead on one the next time you drop by.</p>\n\n<h3 id=\"what-we-believe-in\">What we believe in</h3>\n\n<p>Caf&eacute; Sweet Surrender was started by a group of people from Greve Free Church. The Christian world view of kindness and love to our next is still our driving force, and a cornerstone in our organisation.</p>\n","images":[]},"schemaId":"richTextSection"},{"value":{"heading":"How can I help?","textBlocks":[{"value":{"text":"<p>At Caf&eacute; Sweet Surrender we are totally dependent on our group volunteers and the time and effort they put into the project. Therefor we always welcome anybody who wants to pitch in. So please get in touch! There is almost no limit in how you contribute. From managing our Instagram profile to cleaning the bathrooms&hellip; just to mention two. The more common tasks are described here. But no matter how you want to help &ndash; just use the contact form on this page!</p>\n","image":null},"schemaId":"bb487498319208a9d37ff2b0df17ccf4a68e5f32"},{"value":{"text":"<h3 id=\"bar--kitchen\">Bar &amp; kitchen</h3>\n\n<p>We always welcome more hands to our team, and could certainly need them! If you like to cook and be in a kitchen there is plenty of opportunity to become a part of our kitchen team. What counts is your passion &ndash; we will gladly help you improve your skills!</p>\n\n<p>If you like to smile and interact in a positive way with our customers, we would like to welcome you behind the bar. We will teach you to make an excellent cup of coffee and show you what temperature is the best for the different kind of teas. Besides that, you will need to handle the cashier, serve the food and clean the tables. It&rsquo;s an easy job, but it is a lot of fun.</p>\n","image":"2112a2ef8c726ecb25d2ff19d7eda67047559ae7"},"schemaId":"bb487498319208a9d37ff2b0df17ccf4a68e5f32"},{"value":{"text":"<h3 id=\"café-events\">Caf&eacute; events</h3>\n\n<p>If you know your way around sound and light, and can help arrange small concerts and events&hellip; well you guessed it, you&rsquo;re a perfect match for our Music &amp; Event team. Sign up &ndash; we would love to hear from you.<br />\nWe offer special activities for kids several times a week, and with your help we can keep it up &ndash; or even turn it up a notch. We make crafts, read stories and generally give the visiting kids and their parent a good time. This is probably one of the most giving groups to be part of. But be warned, to make children smile and succeed is very addictive!</p>\n","image":"2112a2ef8c726ecb25d2ff19d7eda67047559ae7"},"schemaId":"bb487498319208a9d37ff2b0df17ccf4a68e5f32"},{"value":{"text":"<h3 id=\"staffing--hr\">Staffing &amp; HR</h3>\n\n<p>Since almost everyone at Caf&eacute; Sweet Surrender is a volunteer, we have a different set of challenges than your average workplace. We have bigger flow of staff, we are more vulnerable if someone gets sick and most members of our team needs basic training to be effective in their role. This is where you come in as a part of our HR team.</p>\n\n<p>Yes, there will be times where you will call someone and ask them why they haven&#39;t signed up for their monthly shift. And yes, you will be part of a group that plan the roster and makes sure every shift is covered.</p>\n\n<p>But you will also be the one that sees people blossom as you train them to be key stake holders in the staff. And you will be the one that brings a smile to a hard-working volunteer by handing them their birthday present from Caf&eacute; Sweet Surrender, and the gift card for taking three shifts a month.</p>\n\n<p>And you can sleep well at night, knowing that you used all your organisational and people skills to make our little project a better and happier place to be at.</p>\n"},"schemaId":"bb487498319208a9d37ff2b0df17ccf4a68e5f32"},{"value":{"text":"<h3 id=\"accounting\">Accounting</h3>\n\n<p>A good accountant never makes mistrakes... and that is why we need you on the team. What can be a painful and devastating task to some, is a dance on a sunny flower filled field.</p>\n\n<p>Because you are best friends with numbers!</p>\n\n<p>You thrive getting salaries and taxes right. Preparing an economic document gives you great feeling as eating a freshly made cupcake. And if you can improve our processes by telling the rest of us how to be like you &hellip; well it would be a shame not to have you on-board.</p>\n"},"schemaId":"bb487498319208a9d37ff2b0df17ccf4a68e5f32"},{"value":{"text":"<h3 id=\"support--fundraising\">Support &amp; Fundraising</h3>\n\n<p>Probably one of the best jobs at Caf&eacute; Sweet Surrender. As part of this group you will find NGO&rsquo;s or causes that will get the surplus from our work. What better way to spend your time! When you are not giving money to good causes, you will try to raise funding and accelerate business at Caf&eacute; Sweet Surrender... so that we can give more money away. Sweeeeeet!</p>\n"},"schemaId":"bb487498319208a9d37ff2b0df17ccf4a68e5f32"},{"value":{"text":"<h3 id=\"would-you-like-to-help-os\">Would you like to help os?</h3>\n\n<p>Please contact David Kyhn on <a href=\"mailto:volunteer@sweetsurrender.dk?subject=Volunteer%20for%20Sweet%20Surrender\">volunteer@sweetsurrender.dk</a> for a cup of coffee and informal conversation.</p>\n"},"schemaId":"bb487498319208a9d37ff2b0df17ccf4a68e5f32"}],"template":"textBlocks"},"schemaId":"textBlocks"}],"navOrder":"4","description":null,"id":"75fb3bd6e8d858ca23300c720820d60467289a46","parentId":"","schemaId":"sectionPage","createDate":"2016-07-06T10:32:06.740Z","updateDate":"2019-03-08T14:01:31.401Z","createdBy":"Unknown","updatedBy":"I Am Test","sort":-1,"language":"en"}